performance/reports/load-test/statistics.json
{
  "Purchase Flow": {
    "transaction": "Purchase Flow",
    "sampleCount": 18750,
    "errorCount": 312,
    "errorPct": 1.664,
    "meanResTime": 1124.7,
    "medianResTime": 987.0,
    "minResTime": 210.0,
    "maxResTime": 8432.0,
    "pct1ResTime": 520.0,
    "pct2ResTime": 1843.0,
    "pct3ResTime": 3210.0,
    "throughput": 62.5,
    "receivedKBytesPerSec": 487.3,
    "sentKBytesPerSec": 28.4
  },
  "01 - GET Home Page": {
    "transaction": "01 - GET Home Page",
    "sampleCount": 18750,
    "errorCount": 0,
    "errorPct": 0.0,
    "meanResTime": 187.4,
    "medianResTime": 162.0,
    "minResTime": 98.0,
    "maxResTime": 1240.0,
    "pct1ResTime": 112.0,
    "pct2ResTime": 342.0,
    "pct3ResTime": 612.0,
    "throughput": 249.8,
    "receivedKBytesPerSec": 1943.1,
    "sentKBytesPerSec": 42.1
  },
  "02 - POST Reserve (Select Flight)": {
    "transaction": "02 - POST Reserve (Select Flight)",
    "sampleCount": 18750,
    "errorCount": 52,
    "errorPct": 0.277,
    "meanResTime": 298.6,
    "medianResTime": 243.0,
    "minResTime": 115.0,
    "maxResTime": 2876.0,
    "pct1ResTime": 148.0,
    "pct2ResTime": 621.0,
    "pct3ResTime": 1204.0,
    "throughput": 249.6,
    "receivedKBytesPerSec": 2847.2,
    "sentKBytesPerSec": 39.8
  },
  "03 - POST Purchase (Passenger Details)": {
    "transaction": "03 - POST Purchase (Passenger Details)",
    "sampleCount": 18750,
    "errorCount": 127,
    "errorPct": 0.677,
    "meanResTime": 412.3,
    "medianResTime": 338.0,
    "minResTime": 142.0,
    "maxResTime": 4218.0,
    "pct1ResTime": 198.0,
    "pct2ResTime": 876.0,
    "pct3ResTime": 1843.0,
    "throughput": 249.4,
    "receivedKBytesPerSec": 3124.7,
    "sentKBytesPerSec": 87.3
  },
  "04 - POST Confirmation (Payment)": {
    "transaction": "04 - POST Confirmation (Payment)",
    "sampleCount": 18750,
    "errorCount": 133,
    "errorPct": 0.709,
    "meanResTime": 526.4,
    "medianResTime": 443.0,
    "minResTime": 178.0,
    "maxResTime": 6341.0,
    "pct1ResTime": 261.0,
    "pct2ResTime": 1124.0,
    "pct3ResTime": 2487.0,
    "throughput": 249.2,
    "receivedKBytesPerSec": 1876.4,
    "sentKBytesPerSec": 112.8
  },
  "Total": {
    "transaction": "Total",
    "sampleCount": 75000,
    "errorCount": 624,
    "errorPct": 0.832,
    "meanResTime": 356.2,
    "medianResTime": 298.0,
    "minResTime": 98.0,
    "maxResTime": 8432.0,
    "pct1ResTime": 187.0,
    "pct2ResTime": 743.0,
    "pct3ResTime": 1624.0,
    "throughput": 249.8,
    "receivedKBytesPerSec": 2457.2,
    "sentKBytesPerSec": 70.1
  }
}